EDT/УТ/src/Reports/ОтчетПоЗаказамВПути/ОтчетПоЗаказамВПути.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ОтчетПоЗаказамВПути</name>
</mdclass:Report>

EDT/УТ/src/AccumulationRegisters/ЗакрытыеЗаказы/ЗакрытыеЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗакрытыеЗаказы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>СуммаОценочная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПолученная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиДоМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДоставкиЗаМКАД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСД</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>БанковскаяКомиссия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассовоеОбслуживание</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Масса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЧастичногоВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоКлиентовНал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>АгентскоеВознаграждение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПредоплатаПоКредиту</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УслугиСДЧистые</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтраховойСбор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическийВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбъемЗабораПоЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВыгруженныйОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьОценочнаяПоТоварно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПереносовСЗаездами</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтоимостьПодъемаМП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоТарифицируемыхРейсов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВознаграждениеАгентаПоПредоплаченнымЗаказам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФрахтЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Поступление</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Списание</name>
    <type>
      <types>DocumentRef.СписаниеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Оприходование</name>
    <type>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Перемещение</name>
    <type>
      <types>DocumentRef.ПеремещениеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакВозврата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИнтернетМагазин</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КатегорияДоставки</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
      <types>CatalogRef.КатегорииДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.ЗаборТовара</types>
      <types>DocumentRef.Фрахт</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипОплаты</name>
    <type>
      <types>CatalogRef.ТипыОплат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусЗаказа</name>
    <type>
      <types>CatalogRef.новаРезультатМестнойДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаНевыполнения</name>
    <type>
      <types>CatalogRef.ПричиныНеВыполненияДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусИнтернетМагазина</name>
    <type>
      <types>CatalogRef.СтатусЗаказаИнтернетМагазина</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтказа</name>
    <type>
      <types>CatalogRef.ПричиныОтказаПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>VIPДоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидVip</name>
    <type>
      <types>CatalogRef.ВидыVip</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСетка</name>
    <type>
      <types>CatalogRef.ТипыТарифов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РасчетныйБрейк</name>
    <type>
      <types>CatalogRef.РасчетныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТарифнаяСеткаПартнера</name>
    <type>
      <types>CatalogRef.ТарифныеСетки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаТарификации</name>
    <type>
      <types>CatalogRef.ГруппыРайонов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаОтклоненияЗаказа</name>
    <comment>Причина отклонения заказа в системе</comment>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТерминалПриёма</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъемныйБрейк</name>
    <type>
      <types>CatalogRef.ОбъемныеБрейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодъемныйБрейк</name>
    <type>
      <types>CatalogRef.ВесовыеБрейкиРасчетаСтоимостиПодъемов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/Накладная003/Накладная003.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Накладная003</name>
  <registerRecords>InformationRegister.ОткорректированныеЗаказы003ПоНакладным</registerRecords>
  <registerRecords>InformationRegister.ДоставкиКУдалению003</registerRecords>
  <registerRecords>InformationRegister.ДатыДоставок</registerRecords>
  <attributes>
    <name>ВходящийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтработанногоДня</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалПриема</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТерминалДоставки</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказы</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.ЗаборТовара</types>
        <types>DocumentRef.Фрахт</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НенайденныеЗаказы</name>
    <attributes>
      <name>НомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийНомерЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗаказа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/Reports/ОтчетПоЗаказамВПути/ObjectModule.bsl
Процедура Сформировать(Т, СписокНомеров) Экспорт
	Т.Очистить();
	Зап = Новый Запрос;
	Зап.Текст = "ВЫБРАТЬ
	            |	РеализацияТоваровУслуг.НомерВнешнегоЗаказа,
	            |	РеализацияТоваровУслуг.Ссылка КАК Док,
				|ПОДСТРОКА(РеализацияТоваровУслуг.НомерВнешнегоЗаказа, 6, 8) Как Н
	            |ИЗ
	            |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	            |ГДЕ
	            |	(ПОДСТРОКА(РеализацияТоваровУслуг.НомерВнешнегоЗаказа, 6, 8) В (&МасНомеров)
	            |			ИЛИ РеализацияТоваровУслуг.НомерВнешнегоЗаказа В (&МасНомеров) ИЛИ РеализацияТоваровУслуг.Номер В (&МасНомеров))";
				
	Зап.УстановитьПараметр("МасНомеров", СписокНомеров);			
	Рез = Зап.Выполнить().Выгрузить();
	
	МасСсылок = Рез.ВыгрузитьКолонку("Док");
	
	
	Зап5 = Новый Запрос;
	Зап5.Текст = "ВЫБРАТЬ
	             |	ЗакрытыеЗаказы.Период,
	             |	ЗакрытыеЗаказы.Регистратор,
	             |	ЗакрытыеЗаказы.НомерСтроки,
	             |	ЗакрытыеЗаказы.Активность,
	             |	ЗакрытыеЗаказы.ТипЗаказа,
	             |	ЗакрытыеЗаказы.Транспорт,
	             |	ЗакрытыеЗаказы.ИнтернетМагазин,
	             |	ЗакрытыеЗаказы.КатегорияДоставки,
	             |	ЗакрытыеЗаказы.Водитель,
	             |	ЗакрытыеЗаказы.Экспедитор,
	             |	ЗакрытыеЗаказы.Клиент,
	             |	ЗакрытыеЗаказы.Реализация,
	             |	ЗакрытыеЗаказы.ТипОплаты,
	             |	ЗакрытыеЗаказы.СтатусЗаказа,
	             |	ЗакрытыеЗаказы.ПричинаНевыполнения,
	             |	ЗакрытыеЗаказы.СтатусИнтернетМагазина,
	             |	ЗакрытыеЗаказы.ПричинаОтказа,
	             |	ЗакрытыеЗаказы.СуммаОценочная,
	             |	ЗакрытыеЗаказы.СуммаПолученная,
	             |	ЗакрытыеЗаказы.СуммаДоставкиДоМКАД,
	             |	ЗакрытыеЗаказы.СуммаДоставкиЗаМКАД,
	             |	ЗакрытыеЗаказы.УслугиСД,
	             |	ЗакрытыеЗаказы.БанковскаяКомиссия,
	             |	ЗакрытыеЗаказы.КассовоеОбслуживание,
	             |	ЗакрытыеЗаказы.СуммаВозврата,
	             |	ЗакрытыеЗаказы.Масса,
	             |	ЗакрытыеЗаказы.СуммаЧастичногоВозврата,
	             |	ЗакрытыеЗаказы.ОплаченоКлиентовНал,
	             |	ЗакрытыеЗаказы.АгентскоеВознаграждение,
	             |	ЗакрытыеЗаказы.Поступление,
	             |	ЗакрытыеЗаказы.Списание,
	             |	ЗакрытыеЗаказы.Оприходование,
	             |	ЗакрытыеЗаказы.Перемещение,
	             |	ЗакрытыеЗаказы.Доставка,
	             |	ЗакрытыеЗаказы.Возврат,
	             |	ЗакрытыеЗаказы.ПризнакВозврата
	             |ИЗ
	             |	РегистрНакопления.ЗакрытыеЗаказы КАК ЗакрытыеЗаказы
	             |ГДЕ
	             |	ЗакрытыеЗаказы.Реализация В(&МасСсылок)";
				 
	Зап5.УстановитьПараметр("МасСсылок", МасСсылок);			 
	Рез5 = Зап5.Выполнить().Выгрузить();
	
	Зап2 = Новый ЗАпрос;
	Зап2.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ЗагрузкаСТСДШтрихкоды.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВТСД,
	             |	0 КАК ЕстьВВозврате,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	РеализацияТоваровУслуг.Дата
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗагрузкаСТСД.Штрихкоды КАК ЗагрузкаСТСДШтрихкоды
	             |		ПО РеализацияТоваровУслуг.Ссылка = ЗагрузкаСТСДШтрихкоды.Заказ.Ссылка
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
				 //|ОБЪЕДИНИТЬ ВСЕ
				 
	Зап3 = Новый Запрос;
	Зап4 = Новый Запрос;
	Зап3.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВВозврате,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Дата
	             |	КОНЕЦ КАК ДатаАкта,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(ВозвратТоваровПоставщикуТовары.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ ВозвратТоваровПоставщикуТовары.Ссылка.Номер
	             |	КОНЕЦ КАК НомерАкта,
	             |	ВозвратТоваровПоставщикуТовары.Ссылка.Ссылка КАК Док
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровПоставщику.Товары КАК ВозвратТоваровПоставщикуТовары
	             |			ПО (ПоступлениеТоваровУслуг.Ссылка = ВозвратТоваровПоставщикуТовары.ДокументПоступления.Ссылка
	             |					И ВозвратТоваровПоставщикуТовары.Ссылка.Проведен = ИСТИНА)
	             |		ПО РеализацияТоваровУслуг.Номер = ПоступлениеТоваровУслуг.Номер
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
				 
	Зап4.Текст = "ВЫБРАТЬ
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ 1
	             |	КОНЕЦ КАК ЕстьВАкте,
	             |	РеализацияТоваровУслуг.Ссылка,
	             |	РеализацияТоваровУслуг.СтатусИнтернетМагазина,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ Накладная003Заказы.Ссылка.Дата
	             |	КОНЕЦ КАК ДатаАкта,
	             |	ВЫБОР
	             |		КОГДА ЕСТЬNULL(Накладная003Заказы.Ссылка, ИСТИНА) = ИСТИНА
	             |			ТОГДА 0
	             |		ИНАЧЕ Накладная003Заказы.Ссылка.Номер
	             |	КОНЕЦ КАК НомерАкта,
	             |	Накладная003Заказы.Ссылка.Ссылка КАК Док
	             |ИЗ
	             |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Накладная003.Заказы КАК Накладная003Заказы
	             |		ПО РеализацияТоваровУслуг.Ссылка = Накладная003Заказы.Заказ.Ссылка
	             |ГДЕ
	             |	РеализацияТоваровУслуг.Ссылка В(&МасСсылок)";
	Зап3.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез3 = Зап3.Выполнить().Выгрузить();
	Зап4.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез4 = Зап4.Выполнить().Выгрузить();
				 
	Зап2.УстановитьПараметр("МасСсылок", МасСсылок);
	Рез2 = Зап2.Выполнить().Выгрузить();
	
	Мак = ПолучитьМакет("Макет");
	Обл = Мак.ПолучитьОбласть("Строка");
	ОблШ = Мак.ПолучитьОбласть("Шапка");
	
	//Для Каждого Тек Из Рез Цикл
	//	Сообщить(Тек.Н);
	//КонецЦикла;	
	
	Т.Вывести(ОблШ);
	
	НПП = 1;
	Для Каждого Тек Из СписокНомеров Цикл
		СтрукНом = Новый Структура;
		СтрукНом.Вставить("НомерВнешнегоЗаказа", Тек);
		
		НайСтроки = Рез.НайтиСтроки(СтрукНом);
		
		Для СчСтр = 0 По НайСтроки.Количество() - 1 Цикл
			Обл.Параметры.НПП = НПП;
			Обл.Параметры.Номер = Тек;
			Най = НайСТроки[СчСтр];
			Если Най <> Неопределено Тогда
				Обл.Параметры.ЕстьВСистеме = истина;
				Най2 = Рез2.Найти(Най.Док);
				Най3 = Рез3.Найти(Най.Док);
				Най4 = Рез4.Найти(Най.Док);
				Най5 = Рез5.Найти(Най.Док);
				Если Най3.ЕстьВВозврате = 1 Тогда
					Обл.Параметры.ЕстьВВозврате = Най3.НомерАкта + " от " + Формат(Най3.ДатаАкта, "ДЛФ=D");
					Обл.Параметры.Док = Най3.Док;
				Иначе
					Обл.Параметры.ЕстьВВозврате = Ложь;
				КонецеСли;	
				
				Если Най4.ЕстьВАкте = 1 Тогда
					Обл.Параметры.ЕстьВАкте = Най4.НомерАкта + " от " + Формат(Най4.ДатаАкта, "ДЛФ=D");
					Обл.Параметры.Док = Най4.Док;
				Иначе
					Обл.Параметры.ЕстьВАкте = Ложь;
				КонецеСли;	
				
				
				Если Най2.ЕстьВТСД = 1 Тогда
					Обл.Параметры.ЕстьВТСД = Истина;
				Иначе
					Обл.Параметры.ЕстьВТСД = Ложь;
				КонецеСли;	
				
				Если Най5 <> Неопределено Тогда
					Если Най5.СтатусИнтернетМагазина = Справочники.СтатусЗаказаИнтернетМагазина.ЗаказЗакрыт тогда
						Обл.Параметры.Доставлен = Най5.Период;
					Иначе	
						Обл.Параметры.Доставлен = "";
					КонецеСли;	
					Обл.параметры.Статус = Най5.Статусзаказа;
				КонецеСли;
			Иначе
				Обл.Параметры.ЕстьВСистеме = Ложь;
				Обл.Параметры.ЕстьВТСД = Ложь;
				Обл.Параметры.ЕстьВВозврате = Ложь;
				Обл.Параметры.Доставлен = Ложь;
			КонецеСли;	
			НПП = НПП + 1;
			т.Вывести(Обл);
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры
